zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
/*! @name SGI_DATIN0D - Input Data register 0 - Word-0 */
/*! @{ */

#define SGI_SGI_DATIN0D_DATIN0D_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN0D_DATIN0D_SHIFT            (0U)
/*! DATIN0D - Input Data register */
#define SGI_SGI_DATIN0D_DATIN0D(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN0D_DATIN0D_SHIFT)) & SGI_SGI_DATIN0D_DATIN0D_MASK)
/*! @} */

/*! @name SGI_DATIN1A - Input Data register 1 - Word-3 */
/*! @{ */

#define SGI_SGI_DATIN1A_DATIN1A_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN1A_DATIN1A_SHIFT            (0U)
/*! DATIN1A - Input Data register */
#define SGI_SGI_DATIN1A_DATIN1A(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN1A_DATIN1A_SHIFT)) & SGI_SGI_DATIN1A_DATIN1A_MASK)
/*! @} */

/*! @name SGI_DATIN1B - Input Data register 1 - Word-2 */
/*! @{ */

#define SGI_SGI_DATIN1B_DATIN1B_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN1B_DATIN1B_SHIFT            (0U)
/*! DATIN1B - Input Data register */
#define SGI_SGI_DATIN1B_DATIN1B(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN1B_DATIN1B_SHIFT)) & SGI_SGI_DATIN1B_DATIN1B_MASK)
/*! @} */

/*! @name SGI_DATIN1C - Input Data register 1 - Word-1 */
/*! @{ */

#define SGI_SGI_DATIN1C_DATIN1C_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN1C_DATIN1C_SHIFT            (0U)
/*! DATIN1C - Input Data register */
#define SGI_SGI_DATIN1C_DATIN1C(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN1C_DATIN1C_SHIFT)) & SGI_SGI_DATIN1C_DATIN1C_MASK)
/*! @} */

/*! @name SGI_DATIN1D - Input Data register 1 - Word-0 */
/*! @{ */

#define SGI_SGI_DATIN1D_DATIN1D_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN1D_DATIN1D_SHIFT            (0U)
/*! DATIN1D - Input Data register */
#define SGI_SGI_DATIN1D_DATIN1D(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN1D_DATIN1D_SHIFT)) & SGI_SGI_DATIN1D_DATIN1D_MASK)
/*! @} */

/*! @name SGI_DATIN2A - Input Data register 2 - Word-3 */
/*! @{ */

#define SGI_SGI_DATIN2A_DATIN2A_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN2A_DATIN2A_SHIFT            (0U)
/*! DATIN2A - Input Data register */
#define SGI_SGI_DATIN2A_DATIN2A(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN2A_DATIN2A_SHIFT)) & SGI_SGI_DATIN2A_DATIN2A_MASK)
/*! @} */

/*! @name SGI_DATIN2B - Input Data register 2 - Word-2 */
/*! @{ */

#define SGI_SGI_DATIN2B_DATIN2B_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN2B_DATIN2B_SHIFT            (0U)
/*! DATIN2B - Input Data register */
#define SGI_SGI_DATIN2B_DATIN2B(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN2B_DATIN2B_SHIFT)) & SGI_SGI_DATIN2B_DATIN2B_MASK)
/*! @} */

/*! @name SGI_DATIN2C - Input Data register 2 - Word-1 */
/*! @{ */

#define SGI_SGI_DATIN2C_DATIN2C_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN2C_DATIN2C_SHIFT            (0U)
/*! DATIN2C - Input Data register */
#define SGI_SGI_DATIN2C_DATIN2C(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN2C_DATIN2C_SHIFT)) & SGI_SGI_DATIN2C_DATIN2C_MASK)
/*! @} */

/*! @name SGI_DATIN2D - Input Data register 2 - Word-0 */
/*! @{ */

#define SGI_SGI_DATIN2D_DATIN2D_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN2D_DATIN2D_SHIFT            (0U)
/*! DATIN2D - Input Data register */
#define SGI_SGI_DATIN2D_DATIN2D(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN2D_DATIN2D_SHIFT)) & SGI_SGI_DATIN2D_DATIN2D_MASK)
/*! @} */

/*! @name SGI_DATIN3A - Input Data register 3 - Word-3 */
/*! @{ */

#define SGI_SGI_DATIN3A_DATIN3A_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN3A_DATIN3A_SHIFT            (0U)
/*! DATIN3A - Input Data register */
#define SGI_SGI_DATIN3A_DATIN3A(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN3A_DATIN3A_SHIFT)) & SGI_SGI_DATIN3A_DATIN3A_MASK)
/*! @} */

/*! @name SGI_DATIN3B - Input Data register 3 - Word-2 */
/*! @{ */

#define SGI_SGI_DATIN3B_DATIN3B_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN3B_DATIN3B_SHIFT            (0U)
/*! DATIN3B - Input Data register */
#define SGI_SGI_DATIN3B_DATIN3B(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN3B_DATIN3B_SHIFT)) & SGI_SGI_DATIN3B_DATIN3B_MASK)
/*! @} */

/*! @name SGI_DATIN3C - Input Data register 3 - Word-1 */
/*! @{ */

#define SGI_SGI_DATIN3C_DATIN3C_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN3C_DATIN3C_SHIFT            (0U)
/*! DATIN3C - Input Data register */
#define SGI_SGI_DATIN3C_DATIN3C(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN3C_DATIN3C_SHIFT)) & SGI_SGI_DATIN3C_DATIN3C_MASK)
/*! @} */

/*! @name SGI_DATIN3D - Input Data register 3 - Word-0 */
/*! @{ */

#define SGI_SGI_DATIN3D_DATIN3D_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN3D_DATIN3D_SHIFT            (0U)
/*! DATIN3D - Input Data register */
#define SGI_SGI_DATIN3D_DATIN3D(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN3D_DATIN3D_SHIFT)) & SGI_SGI_DATIN3D_DATIN3D_MASK)
/*! @} */

/*! @name SGI_KEY0A - Input Key register 0 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY0A_KEY0A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY0A_KEY0A_SHIFT                (0U)
/*! KEY0A - Input Key register */
#define SGI_SGI_KEY0A_KEY0A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY0A_KEY0A_SHIFT)) & SGI_SGI_KEY0A_KEY0A_MASK)
/*! @} */

/*! @name SGI_KEY0B - Input Key register 0 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY0B_KEY0B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY0B_KEY0B_SHIFT                (0U)
/*! KEY0B - Input Key register */
#define SGI_SGI_KEY0B_KEY0B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY0B_KEY0B_SHIFT)) & SGI_SGI_KEY0B_KEY0B_MASK)
/*! @} */

/*! @name SGI_KEY0C - Input Key register 0 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY0C_KEY0C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY0C_KEY0C_SHIFT                (0U)
/*! KEY0C - Input Key register */
#define SGI_SGI_KEY0C_KEY0C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY0C_KEY0C_SHIFT)) & SGI_SGI_KEY0C_KEY0C_MASK)
/*! @} */

/*! @name SGI_KEY0D - Input Key register 0 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY0D_KEY0D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY0D_KEY0D_SHIFT                (0U)
/*! KEY0D - Input Key register */
#define SGI_SGI_KEY0D_KEY0D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY0D_KEY0D_SHIFT)) & SGI_SGI_KEY0D_KEY0D_MASK)
/*! @} */

/*! @name SGI_KEY1A - Input Key register 1 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY1A_KEY1A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY1A_KEY1A_SHIFT                (0U)
/*! KEY1A - Input Key register */
#define SGI_SGI_KEY1A_KEY1A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY1A_KEY1A_SHIFT)) & SGI_SGI_KEY1A_KEY1A_MASK)
/*! @} */

