zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
/*! @name SGI_KEY6A - Input Key register 6 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY6A_KEY6A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY6A_KEY6A_SHIFT                (0U)
/*! KEY6A - Input Key register */
#define SGI_SGI_KEY6A_KEY6A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY6A_KEY6A_SHIFT)) & SGI_SGI_KEY6A_KEY6A_MASK)
/*! @} */

/*! @name SGI_KEY6B - Input Key register 6 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY6B_KEY6B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY6B_KEY6B_SHIFT                (0U)
/*! KEY6B - Input Key register */
#define SGI_SGI_KEY6B_KEY6B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY6B_KEY6B_SHIFT)) & SGI_SGI_KEY6B_KEY6B_MASK)
/*! @} */

/*! @name SGI_KEY6C - Input Key register 6 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY6C_KEY6C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY6C_KEY6C_SHIFT                (0U)
/*! KEY6C - Input Key register */
#define SGI_SGI_KEY6C_KEY6C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY6C_KEY6C_SHIFT)) & SGI_SGI_KEY6C_KEY6C_MASK)
/*! @} */

/*! @name SGI_KEY6D - Input Key register 6 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY6D_KEY6D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY6D_KEY6D_SHIFT                (0U)
/*! KEY6D - Input Key register */
#define SGI_SGI_KEY6D_KEY6D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY6D_KEY6D_SHIFT)) & SGI_SGI_KEY6D_KEY6D_MASK)
/*! @} */

/*! @name SGI_KEY7A - Input Key register 7 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY7A_KEY7A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY7A_KEY7A_SHIFT                (0U)
/*! KEY7A - Input Key register */
#define SGI_SGI_KEY7A_KEY7A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY7A_KEY7A_SHIFT)) & SGI_SGI_KEY7A_KEY7A_MASK)
/*! @} */

/*! @name SGI_KEY7B - Input Key register 7 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY7B_KEY7B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY7B_KEY7B_SHIFT                (0U)
/*! KEY7B - Input Key register */
#define SGI_SGI_KEY7B_KEY7B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY7B_KEY7B_SHIFT)) & SGI_SGI_KEY7B_KEY7B_MASK)
/*! @} */

/*! @name SGI_KEY7C - Input Key register 7 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY7C_KEY7C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY7C_KEY7C_SHIFT                (0U)
/*! KEY7C - Input Key register */
#define SGI_SGI_KEY7C_KEY7C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY7C_KEY7C_SHIFT)) & SGI_SGI_KEY7C_KEY7C_MASK)
/*! @} */

/*! @name SGI_KEY7D - Input Key register 7 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY7D_KEY7D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY7D_KEY7D_SHIFT                (0U)
/*! KEY7D - Input Key register */
#define SGI_SGI_KEY7D_KEY7D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY7D_KEY7D_SHIFT)) & SGI_SGI_KEY7D_KEY7D_MASK)
/*! @} */

/*! @name SGI_DATOUTA - Output Data register - Word-3 */
/*! @{ */

#define SGI_SGI_DATOUTA_DATOUTA_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATOUTA_DATOUTA_SHIFT            (0U)
/*! DATOUTA - Output Data register */
#define SGI_SGI_DATOUTA_DATOUTA(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATOUTA_DATOUTA_SHIFT)) & SGI_SGI_DATOUTA_DATOUTA_MASK)
/*! @} */

/*! @name SGI_DATOUTB - Output Data register - Word-2 */
/*! @{ */

#define SGI_SGI_DATOUTB_DATOUTB_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATOUTB_DATOUTB_SHIFT            (0U)
/*! DATOUTB - Output Data register */
#define SGI_SGI_DATOUTB_DATOUTB(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATOUTB_DATOUTB_SHIFT)) & SGI_SGI_DATOUTB_DATOUTB_MASK)
/*! @} */

/*! @name SGI_DATOUTC - Output Data register - Word-1 */
/*! @{ */

#define SGI_SGI_DATOUTC_DATOUTC_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATOUTC_DATOUTC_SHIFT            (0U)
/*! DATOUTC - Output Data register */
#define SGI_SGI_DATOUTC_DATOUTC(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATOUTC_DATOUTC_SHIFT)) & SGI_SGI_DATOUTC_DATOUTC_MASK)
/*! @} */

/*! @name SGI_DATOUTD - Output Data register - Word-0 */
/*! @{ */

#define SGI_SGI_DATOUTD_DATOUTD_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATOUTD_DATOUTD_SHIFT            (0U)
/*! DATOUTD - Output Data register */
#define SGI_SGI_DATOUTD_DATOUTD(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATOUTD_DATOUTD_SHIFT)) & SGI_SGI_DATOUTD_DATOUTD_MASK)
/*! @} */

/*! @name SGI_STATUS - Status register */
/*! @{ */

#define SGI_SGI_STATUS_BUSY_MASK                 (0x1U)
#define SGI_SGI_STATUS_BUSY_SHIFT                (0U)
/*! BUSY
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SGI_SGI_STATUS_BUSY(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_BUSY_SHIFT)) & SGI_SGI_STATUS_BUSY_MASK)

#define SGI_SGI_STATUS_OFLOW_MASK                (0x2U)
#define SGI_SGI_STATUS_OFLOW_SHIFT               (1U)
/*! OFLOW - Overflow in INCR operation flag
 *  0b0..Clear the flag
 *  0b0..No overflow
 *  0b1..No effect
 *  0b1..Overflow
 */
#define SGI_SGI_STATUS_OFLOW(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_OFLOW_SHIFT)) & SGI_SGI_STATUS_OFLOW_MASK)

#define SGI_SGI_STATUS_PRNG_RDY_MASK             (0x4U)
#define SGI_SGI_STATUS_PRNG_RDY_SHIFT            (2U)
/*! PRNG_RDY
 *  0b0..Not ready
 *  0b1..Ready
 */
#define SGI_SGI_STATUS_PRNG_RDY(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_PRNG_RDY_SHIFT)) & SGI_SGI_STATUS_PRNG_RDY_MASK)

#define SGI_SGI_STATUS_ERROR_MASK                (0x38U)
#define SGI_SGI_STATUS_ERROR_SHIFT               (3U)
/*! ERROR - Error detected
 *  0b000..Error (all values other than 0x05 indicate ERROR)
 *  0b101..No error
 */
#define SGI_SGI_STATUS_ERROR(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_ERROR_SHIFT)) & SGI_SGI_STATUS_ERROR_MASK)

#define SGI_SGI_STATUS_SHA2_BUSY_MASK            (0x40U)
#define SGI_SGI_STATUS_SHA2_BUSY_SHIFT           (6U)
/*! SHA2_BUSY
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SGI_SGI_STATUS_SHA2_BUSY(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_SHA2_BUSY_SHIFT)) & SGI_SGI_STATUS_SHA2_BUSY_MASK)

#define SGI_SGI_STATUS_IRQ_MASK                  (0x80U)
#define SGI_SGI_STATUS_IRQ_SHIFT                 (7U)
/*! IRQ
 *  0b0..Clear the flag
 *  0b0..No IRQ
 *  0b1..IRQ
 *  0b1..No effect
 */
#define SGI_SGI_STATUS_IRQ(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_IRQ_SHIFT)) & SGI_SGI_STATUS_IRQ_MASK)

#define SGI_SGI_STATUS_SHA_FIFO_FULL_MASK        (0x100U)
#define SGI_SGI_STATUS_SHA_FIFO_FULL_SHIFT       (8U)
/*! SHA_FIFO_FULL
 *  0b0..Not full
 *  0b1..Full
 */
#define SGI_SGI_STATUS_SHA_FIFO_FULL(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_SHA_FIFO_FULL_SHIFT)) & SGI_SGI_STATUS_SHA_FIFO_FULL_MASK)

#define SGI_SGI_STATUS_SHA_FIFO_LEVEL_MASK       (0x7E00U)
#define SGI_SGI_STATUS_SHA_FIFO_LEVEL_SHIFT      (9U)
#define SGI_SGI_STATUS_SHA_FIFO_LEVEL(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_SHA_FIFO_LEVEL_SHIFT)) & SGI_SGI_STATUS_SHA_FIFO_LEVEL_MASK)

