zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
#define SGI_SGI_STATUS_SHA_ERROR_MASK            (0x8000U)
#define SGI_SGI_STATUS_SHA_ERROR_SHIFT           (15U)
/*! SHA_ERROR
 *  0b0..No error
 *  0b1..Error
 */
#define SGI_SGI_STATUS_SHA_ERROR(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_SHA_ERROR_SHIFT)) & SGI_SGI_STATUS_SHA_ERROR_MASK)

#define SGI_SGI_STATUS_KEY_READ_ERR_MASK         (0x10000U)
#define SGI_SGI_STATUS_KEY_READ_ERR_SHIFT        (16U)
/*! KEY_READ_ERR - KEY SFR READ ERROR, sticky, cleared only with reset or flush
 *  0b0..No error
 *  0b1..Error
 */
#define SGI_SGI_STATUS_KEY_READ_ERR(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_KEY_READ_ERR_SHIFT)) & SGI_SGI_STATUS_KEY_READ_ERR_MASK)

#define SGI_SGI_STATUS_KEY_UNWRAP_ERR_MASK       (0x20000U)
#define SGI_SGI_STATUS_KEY_UNWRAP_ERR_SHIFT      (17U)
/*! KEY_UNWRAP_ERR - KEY UNWRAP ERROR , sticky, cleared only with reset or flush
 *  0b0..No error
 *  0b1..Error
 */
#define SGI_SGI_STATUS_KEY_UNWRAP_ERR(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_STATUS_KEY_UNWRAP_ERR_SHIFT)) & SGI_SGI_STATUS_KEY_UNWRAP_ERR_MASK)
/*! @} */

/*! @name SGI_COUNT - Calculation counter */
/*! @{ */

#define SGI_SGI_COUNT_COUNT_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_COUNT_COUNT_SHIFT                (0U)
#define SGI_SGI_COUNT_COUNT(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_COUNT_COUNT_SHIFT)) & SGI_SGI_COUNT_COUNT_MASK)
/*! @} */

/*! @name SGI_KEYCHK - Key checksum register */
/*! @{ */

#define SGI_SGI_KEYCHK_KEYCHKSUM_MASK            (0xFFFFFFFFU)
#define SGI_SGI_KEYCHK_KEYCHKSUM_SHIFT           (0U)
/*! KEYCHKSUM - Key checksum (32-bit). */
#define SGI_SGI_KEYCHK_KEYCHKSUM(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEYCHK_KEYCHKSUM_SHIFT)) & SGI_SGI_KEYCHK_KEYCHKSUM_MASK)
/*! @} */

/*! @name SGI_PRNG_SW_READ - SGI PRNG read register */
/*! @{ */

#define SGI_SGI_PRNG_SW_READ_RANDOM_MASK         (0xFFFFFFFFU)
#define SGI_SGI_PRNG_SW_READ_RANDOM_SHIFT        (0U)
/*! RANDOM - 32-bit field to return random data from PRNG */
#define SGI_SGI_PRNG_SW_READ_RANDOM(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_PRNG_SW_READ_RANDOM_SHIFT)) & SGI_SGI_PRNG_SW_READ_RANDOM_MASK)
/*! @} */

/*! @name SGI_CTRL - SGI Control register */
/*! @{ */

#define SGI_SGI_CTRL_START_MASK                  (0x1U)
#define SGI_SGI_CTRL_START_SHIFT                 (0U)
/*! START - Start crypto operation
 *  0b0..Clr has no effect
 *  0b1..Set to start operation
 */
#define SGI_SGI_CTRL_START(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_START_SHIFT)) & SGI_SGI_CTRL_START_MASK)

#define SGI_SGI_CTRL_DECRYPT_MASK                (0x2U)
#define SGI_SGI_CTRL_DECRYPT_SHIFT               (1U)
/*! DECRYPT
 *  0b0..Encryption
 *  0b1..Decryption
 */
#define SGI_SGI_CTRL_DECRYPT(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_DECRYPT_SHIFT)) & SGI_SGI_CTRL_DECRYPT_MASK)

#define SGI_SGI_CTRL_AESKEYSZ_MASK               (0xCU)
#define SGI_SGI_CTRL_AESKEYSZ_SHIFT              (2U)
/*! AESKEYSZ
 *  0b00..AES-128
 *  0b01..AES-192
 *  0b10..AES-256
 *  0b11..RFU (defaults to AES-128)
 */
#define SGI_SGI_CTRL_AESKEYSZ(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AESKEYSZ_SHIFT)) & SGI_SGI_CTRL_AESKEYSZ_MASK)

#define SGI_SGI_CTRL_CRYPTO_OP_MASK              (0x70U)
#define SGI_SGI_CTRL_CRYPTO_OP_SHIFT             (4U)
/*! CRYPTO_OP - Sets 'Crypto Operation' type
 *  0b000..AES
 *  0b001..Reserved
 *  0b010..Reserved
 *  0b011..GFMUL(If Included)
 *  0b100..SHA2 (If Included)
 *  0b101..CMAC (If Included)
 *  0b110-0b111..others - RFU (Defaults to 1st available OP)
 */
#define SGI_SGI_CTRL_CRYPTO_OP(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_CRYPTO_OP_SHIFT)) & SGI_SGI_CTRL_CRYPTO_OP_MASK)

#define SGI_SGI_CTRL_INSEL_MASK                  (0x780U)
#define SGI_SGI_CTRL_INSEL_SHIFT                 (7U)
/*! INSEL
 *  0b0000..DATIN[0]
 *  0b0001..DATIN[1]*
 *  0b0010..DATIN[2]*
 *  0b0011..DATIN[3]*
 *  0b0100..DATIN[0] ^ DATOUT
 *  0b0101..DATIN[1] ^ DATOUT*
 *  0b0110..DATIN[2] ^ DATOUT*
 *  0b0111..DATIN[3] ^ DATOUT*
 *  0b1000..DATOUT
 *  0b1001-0b1111..others - DATIN[0] * - only if DATIN[num] exists, else [0]
 */
#define SGI_SGI_CTRL_INSEL(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_INSEL_SHIFT)) & SGI_SGI_CTRL_INSEL_MASK)

#define SGI_SGI_CTRL_OUTSEL_MASK                 (0x3800U)
#define SGI_SGI_CTRL_OUTSEL_SHIFT                (11U)
/*! OUTSEL
 *  0b000..DATOUT = 'Kernel Res'
 *  0b001..DATOUT = 'Kernel Res' ^ DATIN[0]
 *  0b010..DATOUT = 'Kernel Res' ^ DATIN[1]*
 *  0b011..DATOUT = 'Kernel Res' ^ DATIN[2]*
 *  0b100..DATOUT = 'Kernel Res' ^DATIN[3]*
 *  0b101-0b111..others - DATOUT = 'Kernel Res' * - only if DATIN[num] exists, else [0]
 */
#define SGI_SGI_CTRL_OUTSEL(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_OUTSEL_SHIFT)) & SGI_SGI_CTRL_OUTSEL_MASK)

#define SGI_SGI_CTRL_DATOUT_RES_MASK             (0xC000U)
#define SGI_SGI_CTRL_DATOUT_RES_SHIFT            (14U)
/*! DATOUT_RES
 *  0b00..END_UP
 *  0b01..START_UP
 *  0b10..TRIGGER_UP
 *  0b11..NO_UP
 */
#define SGI_SGI_CTRL_DATOUT_RES(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_DATOUT_RES_SHIFT)) & SGI_SGI_CTRL_DATOUT_RES_MASK)

#define SGI_SGI_CTRL_AES_EN_MASK                 (0x10000U)
#define SGI_SGI_CTRL_AES_EN_SHIFT                (16U)
/*! AES_EN
 *  0b0..AES disabled
 *  0b1..AES enabled
 */
#define SGI_SGI_CTRL_AES_EN(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_EN_SHIFT)) & SGI_SGI_CTRL_AES_EN_MASK)

#define SGI_SGI_CTRL_GCM_EN_MASK                 (0x40000U)
#define SGI_SGI_CTRL_GCM_EN_SHIFT                (18U)
/*! GCM_EN
 *  0b0..GFMUL disabled
 *  0b1..GFMUL enabled
 */
#define SGI_SGI_CTRL_GCM_EN(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_GCM_EN_SHIFT)) & SGI_SGI_CTRL_GCM_EN_MASK)

#define SGI_SGI_CTRL_PRNG_EN_MASK                (0x80000U)
#define SGI_SGI_CTRL_PRNG_EN_SHIFT               (19U)
/*! PRNG_EN - PRNG Enable (only if SGI has internal PRNG)
 *  0b0..PRNG Disabled
 *  0b1..PRNG Enabled
 */
#define SGI_SGI_CTRL_PRNG_EN(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_PRNG_EN_SHIFT)) & SGI_SGI_CTRL_PRNG_EN_MASK)

#define SGI_SGI_CTRL_INKEYSEL_MASK               (0x1F00000U)
#define SGI_SGI_CTRL_INKEYSEL_SHIFT              (20U)
/*! INKEYSEL - Input key selection */
#define SGI_SGI_CTRL_INKEYSEL(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_INKEYSEL_SHIFT)) & SGI_SGI_CTRL_INKEYSEL_MASK)

#define SGI_SGI_CTRL_AES_NO_KL_MASK              (0x4000000U)
#define SGI_SGI_CTRL_AES_NO_KL_SHIFT             (26U)
/*! AES_NO_KL
 *  0b0..new AES key will be loaded
 *  0b1..No AES key will be loaded, and previously loaded key will be used.
 */
#define SGI_SGI_CTRL_AES_NO_KL(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_NO_KL_SHIFT)) & SGI_SGI_CTRL_AES_NO_KL_MASK)

