zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
#define SGI_SGI_CTRL_AES_SEL_MASK                (0x8000000U)
#define SGI_SGI_CTRL_AES_SEL_SHIFT               (27U)
/*! AES_SEL
 *  0b0..First AES selected
 *  0b1..Second AES selected (when enabled)
 */
#define SGI_SGI_CTRL_AES_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL_AES_SEL_SHIFT)) & SGI_SGI_CTRL_AES_SEL_MASK)
/*! @} */

/*! @name SGI_CTRL2 - SGI Control register 2 */
/*! @{ */

#define SGI_SGI_CTRL2_FLUSH_MASK                 (0x1U)
#define SGI_SGI_CTRL2_FLUSH_SHIFT                (0U)
/*! FLUSH - Start Full SGI Flush
 *  0b0..Clr has no effect
 *  0b1..Set to start flush
 */
#define SGI_SGI_CTRL2_FLUSH(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_FLUSH_SHIFT)) & SGI_SGI_CTRL2_FLUSH_MASK)

#define SGI_SGI_CTRL2_KEY_FLUSH_MASK             (0x2U)
#define SGI_SGI_CTRL2_KEY_FLUSH_SHIFT            (1U)
/*! KEY_FLUSH - Start KEY register-bank Flush
 *  0b0..Clr has no effect
 *  0b1..Set to start flush
 */
#define SGI_SGI_CTRL2_KEY_FLUSH(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_KEY_FLUSH_SHIFT)) & SGI_SGI_CTRL2_KEY_FLUSH_MASK)

#define SGI_SGI_CTRL2_DATIN_FLUSH_MASK           (0x4U)
#define SGI_SGI_CTRL2_DATIN_FLUSH_SHIFT          (2U)
/*! DATIN_FLUSH - Start DATIN register-bank Flush
 *  0b0..Clr has no effect
 *  0b1..Set to start flush
 */
#define SGI_SGI_CTRL2_DATIN_FLUSH(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_DATIN_FLUSH_SHIFT)) & SGI_SGI_CTRL2_DATIN_FLUSH_MASK)

#define SGI_SGI_CTRL2_INCR_MASK                  (0x8U)
#define SGI_SGI_CTRL2_INCR_SHIFT                 (3U)
/*! INCR - Increment(Triggered by SFR write)
 *  0b0..INCR-On-Write disabled
 *  0b1..INCR-On-Write enabled
 */
#define SGI_SGI_CTRL2_INCR(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_INCR_SHIFT)) & SGI_SGI_CTRL2_INCR_MASK)

#define SGI_SGI_CTRL2_XORWR_MASK                 (0x10U)
#define SGI_SGI_CTRL2_XORWR_SHIFT                (4U)
/*! XORWR - Write-XOR control
 *  0b0..XOR-On-Write disabled
 *  0b1..XOR-On-Write enabled
 */
#define SGI_SGI_CTRL2_XORWR(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_XORWR_SHIFT)) & SGI_SGI_CTRL2_XORWR_MASK)

#define SGI_SGI_CTRL2_FLUSHWR_MASK               (0x20U)
#define SGI_SGI_CTRL2_FLUSHWR_SHIFT              (5U)
/*! FLUSHWR - Flush Write control
 *  0b0..Flush-Write disabled
 *  0b1..Flush-Write enabled
 */
#define SGI_SGI_CTRL2_FLUSHWR(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_FLUSHWR_SHIFT)) & SGI_SGI_CTRL2_FLUSHWR_MASK)

#define SGI_SGI_CTRL2_INCR_CIN_MASK              (0x40U)
#define SGI_SGI_CTRL2_INCR_CIN_SHIFT             (6U)
/*! INCR_CIN - Increment Carry-In control
 *  0b0..Carry-In for INCR is 1
 *  0b1..Carry-In for INCR is overflow from previous INCR operation
 */
#define SGI_SGI_CTRL2_INCR_CIN(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_INCR_CIN_SHIFT)) & SGI_SGI_CTRL2_INCR_CIN_MASK)

#define SGI_SGI_CTRL2_SMASKEN_MASK               (0x100U)
#define SGI_SGI_CTRL2_SMASKEN_SHIFT              (8U)
/*! SMASKEN - SFRMASK Enable
 *  0b0..SFRMASK feature Disabled
 *  0b1..SFRMASK feature Enabled
 */
#define SGI_SGI_CTRL2_SMASKEN(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKEN_SHIFT)) & SGI_SGI_CTRL2_SMASKEN_MASK)

#define SGI_SGI_CTRL2_SMASKSTEP_MASK             (0x200U)
#define SGI_SGI_CTRL2_SMASKSTEP_SHIFT            (9U)
/*! SMASKSTEP - SFRSEED increment control
 *  0b0..SFRSEED increments every regbank access
 *  0b1..SFRSEED increments every regbank access PLUS when SFRSEED in read
 */
#define SGI_SGI_CTRL2_SMASKSTEP(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKSTEP_SHIFT)) & SGI_SGI_CTRL2_SMASKSTEP_MASK)

#define SGI_SGI_CTRL2_SMASKSW_MASK               (0x400U)
#define SGI_SGI_CTRL2_SMASKSW_SHIFT              (10U)
/*! SMASKSW - SFRMASK MASK control
 *  0b0..SFR MASK output directly controlled by HW mask generator
 *  0b1..SFR MASK output directly controlled by SW
 */
#define SGI_SGI_CTRL2_SMASKSW(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_SMASKSW_SHIFT)) & SGI_SGI_CTRL2_SMASKSW_MASK)

#define SGI_SGI_CTRL2_MOVEM_MASK                 (0xF000U)
#define SGI_SGI_CTRL2_MOVEM_SHIFT                (12U)
/*! MOVEM - 4-bit optional input for MOVEM feature */
#define SGI_SGI_CTRL2_MOVEM(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_MOVEM_SHIFT)) & SGI_SGI_CTRL2_MOVEM_MASK)

#define SGI_SGI_CTRL2_KEYRES_MASK                (0x1F0000U)
#define SGI_SGI_CTRL2_KEYRES_SHIFT               (16U)
/*! KEYRES - Selects key registers to be updated when rkey=1 */
#define SGI_SGI_CTRL2_KEYRES(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_KEYRES_SHIFT)) & SGI_SGI_CTRL2_KEYRES_MASK)

#define SGI_SGI_CTRL2_RKEY_MASK                  (0x200000U)
#define SGI_SGI_CTRL2_RKEY_SHIFT                 (21U)
/*! RKEY - Crypto result location
 *  0b0..DATOUT register bank
 *  0b1..KEY register bank
 */
#define SGI_SGI_CTRL2_RKEY(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_RKEY_SHIFT)) & SGI_SGI_CTRL2_RKEY_MASK)

#define SGI_SGI_CTRL2_BYTES_ORDER_MASK           (0x400000U)
#define SGI_SGI_CTRL2_BYTES_ORDER_SHIFT          (22U)
/*! BYTES_ORDER - Byte order of regbank read/write data
 *  0b0..Normal
 *  0b1..Swapped
 */
#define SGI_SGI_CTRL2_BYTES_ORDER(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_BYTES_ORDER_SHIFT)) & SGI_SGI_CTRL2_BYTES_ORDER_MASK)

#define SGI_SGI_CTRL2_GCM_INXOR_MASK             (0x800000U)
#define SGI_SGI_CTRL2_GCM_INXOR_SHIFT            (23U)
/*! GCM_INXOR - GCM INXOR
 *  0b0..GCM INXOR disabled
 *  0b1..GCM INXOR enabled
 */
#define SGI_SGI_CTRL2_GCM_INXOR(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CTRL2_GCM_INXOR_SHIFT)) & SGI_SGI_CTRL2_GCM_INXOR_MASK)
/*! @} */

/*! @name SGI_DUMMY_CTRL - Configuration of dummy controls */
/*! @{ */

#define SGI_SGI_DUMMY_CTRL_ADCTRL_MASK           (0x3FF0000U)
#define SGI_SGI_DUMMY_CTRL_ADCTRL_SHIFT          (16U)
#define SGI_SGI_DUMMY_CTRL_ADCTRL(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DUMMY_CTRL_ADCTRL_SHIFT)) & SGI_SGI_DUMMY_CTRL_ADCTRL_MASK)
/*! @} */

/*! @name SGI_SFRSEED - SFRSEED register for SFRMASK feature */
/*! @{ */

#define SGI_SGI_SFRSEED_SFRSEED_MASK             (0xFFFFFFFFU)
#define SGI_SGI_SFRSEED_SFRSEED_SHIFT            (0U)
/*! SFRSEED - Seed/mask used for sw level masking */
#define SGI_SGI_SFRSEED_SFRSEED(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SFRSEED_SFRSEED_SHIFT)) & SGI_SGI_SFRSEED_SFRSEED_MASK)
/*! @} */

