zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
/*! @name SGI_SHA2_CTRL - SHA Control Register */
/*! @{ */

#define SGI_SGI_SHA2_CTRL_SHA2_EN_MASK           (0x1U)
#define SGI_SGI_SHA2_CTRL_SHA2_EN_SHIFT          (0U)
/*! SHA2_EN - SHA enable
 *  0b0..SHA disabled
 *  0b1..SHA enabled
 */
#define SGI_SGI_SHA2_CTRL_SHA2_EN(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_EN_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_EN_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_MODE_MASK         (0x2U)
#define SGI_SGI_SHA2_CTRL_SHA2_MODE_SHIFT        (1U)
/*! SHA2_MODE - SHA mode normal or automatic
 *  0b0..SHA NORM Mode
 *  0b1..SHA AUTO Mode
 */
#define SGI_SGI_SHA2_CTRL_SHA2_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_MODE_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_MODE_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_SIZE_MASK         (0xCU)
#define SGI_SGI_SHA2_CTRL_SHA2_SIZE_SHIFT        (2U)
/*! SHA2_SIZE
 *  0b00..SHA-224
 *  0b01..SHA-256
 *  0b10..SHA-384(or SHA-224 if SHA-256 only)
 *  0b11..SHA-512 (or SHA-256 if SHA-256 only)
 */
#define SGI_SGI_SHA2_CTRL_SHA2_SIZE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_SIZE_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_SIZE_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_MASK      (0xF0U)
#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_SHIFT     (4U)
/*! SHA2_LOW_LIM - SHA FIFO low limit */
#define SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_LOW_LIM_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_MASK     (0xF00U)
#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_SHIFT    (8U)
/*! SHA2_HIGH_LIM - SHA FIFO high limit */
#define SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_HIGH_LIM_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_MASK     (0x1000U)
#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_SHIFT    (12U)
/*! SHA2_COUNT_EN - SHA Calculation counter enable
 *  0b0..SHA operation DOES NOT increment COUNT
 *  0b1..SHA operation DOES increment count
 */
#define SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN(x)       (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_COUNT_EN_MASK)

#define SGI_SGI_SHA2_CTRL_HASH_RELOAD_MASK       (0x2000U)
#define SGI_SGI_SHA2_CTRL_HASH_RELOAD_SHIFT      (13U)
/*! HASH_RELOAD - SHA HASH reload
 *  0b0..No HASH reload
 *  0b1..HASH reload enabled
 */
#define SGI_SGI_SHA2_CTRL_HASH_RELOAD(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_HASH_RELOAD_SHIFT)) & SGI_SGI_SHA2_CTRL_HASH_RELOAD_MASK)

#define SGI_SGI_SHA2_CTRL_SHA2_STOP_MASK         (0x4000U)
#define SGI_SGI_SHA2_CTRL_SHA2_STOP_SHIFT        (14U)
/*! SHA2_STOP - STOP SHA AUTO mode
 *  0b0..Keep running
 *  0b1..Stop auto mode
 */
#define SGI_SGI_SHA2_CTRL_SHA2_STOP(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_SHA2_STOP_SHIFT)) & SGI_SGI_SHA2_CTRL_SHA2_STOP_MASK)

#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_MASK      (0x8000U)
#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_SHIFT     (15U)
/*! NO_AUTO_INIT - SHA no automatic HASH initialisation
 *  0b0..SHA automatic HASH initialisation
 *  0b1..No SHA automatic HASH initialisation
 */
#define SGI_SGI_SHA2_CTRL_NO_AUTO_INIT(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_SHIFT)) & SGI_SGI_SHA2_CTRL_NO_AUTO_INIT_MASK)
/*! @} */

/*! @name SGI_SHA_FIFO - SHA FIFO lower-bank low */
/*! @{ */

#define SGI_SGI_SHA_FIFO_FIFO_MASK               (0xFFFFFFFFU)
#define SGI_SGI_SHA_FIFO_FIFO_SHIFT              (0U)
/*! FIFO - SHA FIFO register */
#define SGI_SGI_SHA_FIFO_FIFO(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_SHA_FIFO_FIFO_SHIFT)) & SGI_SGI_SHA_FIFO_FIFO_MASK)
/*! @} */

/*! @name SGI_CONFIG - SHA Configuration Reg */
/*! @{ */

#define SGI_SGI_CONFIG_ROW_MASK                  (0x1U)
#define SGI_SGI_CONFIG_ROW_SHIFT                 (0U)
/*! ROW - SGI Diversified for 'ROW' */
#define SGI_SGI_CONFIG_ROW(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_ROW_SHIFT)) & SGI_SGI_CONFIG_ROW_MASK)

#define SGI_SGI_CONFIG_CHINA_MASK                (0x2U)
#define SGI_SGI_CONFIG_CHINA_SHIFT               (1U)
/*! CHINA - SGI Diversified for 'CHINA' */
#define SGI_SGI_CONFIG_CHINA(x)                  (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CHINA_SHIFT)) & SGI_SGI_CONFIG_CHINA_MASK)

#define SGI_SGI_CONFIG_CC_MASK                   (0x4U)
#define SGI_SGI_CONFIG_CC_SHIFT                  (2U)
/*! CC - SGI Diversified for 'CC' */
#define SGI_SGI_CONFIG_CC(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_CC_SHIFT)) & SGI_SGI_CONFIG_CC_MASK)

#define SGI_SGI_CONFIG_HAS_AES_MASK              (0x8U)
#define SGI_SGI_CONFIG_HAS_AES_SHIFT             (3U)
/*! HAS_AES - HAS AES */
#define SGI_SGI_CONFIG_HAS_AES(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_AES_SHIFT)) & SGI_SGI_CONFIG_HAS_AES_MASK)

#define SGI_SGI_CONFIG_HAS_DES_MASK              (0x10U)
#define SGI_SGI_CONFIG_HAS_DES_SHIFT             (4U)
/*! HAS_DES - HAS DES */
#define SGI_SGI_CONFIG_HAS_DES(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_DES_SHIFT)) & SGI_SGI_CONFIG_HAS_DES_MASK)

#define SGI_SGI_CONFIG_HAS_SHA_MASK              (0x20U)
#define SGI_SGI_CONFIG_HAS_SHA_SHIFT             (5U)
/*! HAS_SHA - HAS SHA */
#define SGI_SGI_CONFIG_HAS_SHA(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_SHA_SHIFT)) & SGI_SGI_CONFIG_HAS_SHA_MASK)

#define SGI_SGI_CONFIG_HAS_MOVEM_MASK            (0x40U)
#define SGI_SGI_CONFIG_HAS_MOVEM_SHIFT           (6U)
/*! HAS_MOVEM - HAS MOVEM */
#define SGI_SGI_CONFIG_HAS_MOVEM(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_MOVEM_SHIFT)) & SGI_SGI_CONFIG_HAS_MOVEM_MASK)

#define SGI_SGI_CONFIG_HAS_GFMUL_MASK            (0x100U)
#define SGI_SGI_CONFIG_HAS_GFMUL_SHIFT           (8U)
/*! HAS_GFMUL - HAS GFMUL */
#define SGI_SGI_CONFIG_HAS_GFMUL(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_HAS_GFMUL_SHIFT)) & SGI_SGI_CONFIG_HAS_GFMUL_MASK)

#define SGI_SGI_CONFIG_INTERNAL_PRNG_MASK        (0x200U)
#define SGI_SGI_CONFIG_INTERNAL_PRNG_SHIFT       (9U)
/*! INTERNAL_PRNG - HAS INTERNAL PRNG */
#define SGI_SGI_CONFIG_INTERNAL_PRNG(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_INTERNAL_PRNG_SHIFT)) & SGI_SGI_CONFIG_INTERNAL_PRNG_MASK)

#define SGI_SGI_CONFIG_KEY_DIGEST_MASK           (0x400U)
#define SGI_SGI_CONFIG_KEY_DIGEST_SHIFT          (10U)
/*! KEY_DIGEST - HAS KEY DIGEST */
#define SGI_SGI_CONFIG_KEY_DIGEST(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_KEY_DIGEST_SHIFT)) & SGI_SGI_CONFIG_KEY_DIGEST_MASK)

