zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_SGI.h
#define SGI_SGI_CONFIG_COUNT_SIZE_MASK           (0x800U)
#define SGI_SGI_CONFIG_COUNT_SIZE_SHIFT          (11U)
/*! COUNT_SIZE - 0 - COUNT=16, 1 - COUNT=32 */
#define SGI_SGI_CONFIG_COUNT_SIZE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_COUNT_SIZE_SHIFT)) & SGI_SGI_CONFIG_COUNT_SIZE_MASK)

#define SGI_SGI_CONFIG_FA_MASK                   (0x2000U)
#define SGI_SGI_CONFIG_FA_SHIFT                  (13U)
/*! FA - HAS FA protection */
#define SGI_SGI_CONFIG_FA(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_FA_SHIFT)) & SGI_SGI_CONFIG_FA_MASK)

#define SGI_SGI_CONFIG_BUS_WIDTH_MASK            (0x8000U)
#define SGI_SGI_CONFIG_BUS_WIDTH_SHIFT           (15U)
/*! BUS_WIDTH - 0 - BUS_WIDTH=16, 1 - BUS_WIDTH=32 */
#define SGI_SGI_CONFIG_BUS_WIDTH(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_BUS_WIDTH_SHIFT)) & SGI_SGI_CONFIG_BUS_WIDTH_MASK)

#define SGI_SGI_CONFIG_NUM_DATIN_MASK            (0x30000U)
#define SGI_SGI_CONFIG_NUM_DATIN_SHIFT           (16U)
/*! NUM_DATIN - NUMBER OF DATIN REGBANKS */
#define SGI_SGI_CONFIG_NUM_DATIN(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_NUM_DATIN_SHIFT)) & SGI_SGI_CONFIG_NUM_DATIN_MASK)

#define SGI_SGI_CONFIG_NUM_KEY_MASK              (0x1C0000U)
#define SGI_SGI_CONFIG_NUM_KEY_SHIFT             (18U)
/*! NUM_KEY - NUMBER OR KEY REGBANKS */
#define SGI_SGI_CONFIG_NUM_KEY(x)                (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_NUM_KEY_SHIFT)) & SGI_SGI_CONFIG_NUM_KEY_MASK)

#define SGI_SGI_CONFIG_EDC_MASK                  (0x200000U)
#define SGI_SGI_CONFIG_EDC_SHIFT                 (21U)
/*! EDC - DATIN to KERNEL End-to-end EDC is enabled */
#define SGI_SGI_CONFIG_EDC(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_EDC_SHIFT)) & SGI_SGI_CONFIG_EDC_MASK)

#define SGI_SGI_CONFIG_SHA_256_ONLY_MASK         (0x1000000U)
#define SGI_SGI_CONFIG_SHA_256_ONLY_SHIFT        (24U)
/*! SHA_256_ONLY - HAS SHA-256 ONLY */
#define SGI_SGI_CONFIG_SHA_256_ONLY(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SHA_256_ONLY_SHIFT)) & SGI_SGI_CONFIG_SHA_256_ONLY_MASK)

#define SGI_SGI_CONFIG_SPB_SUPPORT_MASK          (0x2000000U)
#define SGI_SGI_CONFIG_SPB_SUPPORT_SHIFT         (25U)
/*! SPB_SUPPORT - ID_CFG_SGI_SPB_SUPPORT is set */
#define SGI_SGI_CONFIG_SPB_SUPPORT(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SPB_SUPPORT_SHIFT)) & SGI_SGI_CONFIG_SPB_SUPPORT_MASK)

#define SGI_SGI_CONFIG_SPB_MASKING_MASK          (0x4000000U)
#define SGI_SGI_CONFIG_SPB_MASKING_SHIFT         (26U)
/*! SPB_MASKING - ID_CFG_SGI_SPB_MASKING is set */
#define SGI_SGI_CONFIG_SPB_MASKING(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SPB_MASKING_SHIFT)) & SGI_SGI_CONFIG_SPB_MASKING_MASK)

#define SGI_SGI_CONFIG_SFR_SW_MASK_MASK          (0x8000000U)
#define SGI_SGI_CONFIG_SFR_SW_MASK_SHIFT         (27U)
/*! SFR_SW_MASK - ID_CFG_SGI_USE_SFR_SW_MASK is set */
#define SGI_SGI_CONFIG_SFR_SW_MASK(x)            (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG_SFR_SW_MASK_SHIFT)) & SGI_SGI_CONFIG_SFR_SW_MASK_MASK)
/*! @} */

/*! @name SGI_CONFIG2 - SHA Configuration 2 Reg */
/*! @{ */

#define SGI_SGI_CONFIG2_AES_USED_MASK            (0xFU)
#define SGI_SGI_CONFIG2_AES_USED_SHIFT           (0U)
/*! AES_USED
 *  0b0000..Apollo
 *  0b0001..Aegis
 *  0b0010..Ayna
 *  0b0011..Athenium
 *  0b0100..Ajax
 *  0b0101..Aegis_hs
 *  0b0110..Athenium_hs
 *  0b0111..ATE
 *  0b1000..ATOM
 *  0b1001..Asterix
 *  0b1010-0b1111..RFU
 */
#define SGI_SGI_CONFIG2_AES_USED(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_USED_SHIFT)) & SGI_SGI_CONFIG2_AES_USED_MASK)

#define SGI_SGI_CONFIG2_AES_NUM_SBOXES_MASK      (0x1F0U)
#define SGI_SGI_CONFIG2_AES_NUM_SBOXES_SHIFT     (4U)
/*! AES_NUM_SBOXES - Number of AES sboxes */
#define SGI_SGI_CONFIG2_AES_NUM_SBOXES(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_NUM_SBOXES_SHIFT)) & SGI_SGI_CONFIG2_AES_NUM_SBOXES_MASK)

#define SGI_SGI_CONFIG2_AES_KEYSIZE_MASK         (0x600U)
#define SGI_SGI_CONFIG2_AES_KEYSIZE_SHIFT        (9U)
/*! AES_KEYSIZE
 *  0b00..128 0nly
 *  0b01..192 only
 *  0b10..256 only
 *  0b11..All key sizes
 */
#define SGI_SGI_CONFIG2_AES_KEYSIZE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_AES_KEYSIZE_SHIFT)) & SGI_SGI_CONFIG2_AES_KEYSIZE_MASK)

#define SGI_SGI_CONFIG2_DES_USED_MASK            (0xF0000U)
#define SGI_SGI_CONFIG2_DES_USED_SHIFT           (16U)
/*! DES_USED
 *  0b0000..Dakar
 *  0b0001..Danube
 *  0b0010..Depicta
 *  0b0011..Digi
 *  0b0100..Date
 *  0b0101..Desert
 *  0b0110-0b1111..RFU
 */
#define SGI_SGI_CONFIG2_DES_USED(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_DES_USED_SHIFT)) & SGI_SGI_CONFIG2_DES_USED_MASK)

#define SGI_SGI_CONFIG2_DES_NUM_SBOXES_MASK      (0x1F00000U)
#define SGI_SGI_CONFIG2_DES_NUM_SBOXES_SHIFT     (20U)
/*! DES_NUM_SBOXES - Number of DES sboxes */
#define SGI_SGI_CONFIG2_DES_NUM_SBOXES(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_CONFIG2_DES_NUM_SBOXES_SHIFT)) & SGI_SGI_CONFIG2_DES_NUM_SBOXES_MASK)
/*! @} */

/*! @name SGI_AUTO_MODE - SGI Auto Mode Control register */
/*! @{ */

#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN_MASK      (0x1U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN_SHIFT     (0U)
/*! AUTO_MODE_EN - auto_start_en
 *  0b1..auto mode has been selected
 */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_EN(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_EN_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_EN_MASK)

#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_MASK    (0x2U)
#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_SHIFT   (1U)
/*! AUTO_MODE_STOP - auto_mode_stop
 *  0b1..exit auto mode as soon as the data has been emptied
 */
#define SGI_SGI_AUTO_MODE_AUTO_MODE_STOP(x)      (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_SHIFT)) & SGI_SGI_AUTO_MODE_AUTO_MODE_STOP_MASK)

#define SGI_SGI_AUTO_MODE_INCR_MODE_MASK         (0x30U)
#define SGI_SGI_AUTO_MODE_INCR_MODE_SHIFT        (4U)
/*! INCR_MODE - CTR increment mode
 *  0b00..2**32 increment mode
 *  0b01..2**64 increment mode
 *  0b10..2**96 increment mode
 *  0b11..2**128 increment mode
 */
#define SGI_SGI_AUTO_MODE_INCR_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_INCR_MODE_SHIFT)) & SGI_SGI_AUTO_MODE_INCR_MODE_MASK)

#define SGI_SGI_AUTO_MODE_CMD_MASK               (0xFF00U)
#define SGI_SGI_AUTO_MODE_CMD_SHIFT              (8U)
/*! CMD - Auto mode of operation
 *  0b00000000..ECB mode
 *  0b00000001..CTR mode
 *  0b00000010..CBC mode
 *  0b00000011..CBCMAC mode
 *  0b00010000..Key Wrap/Unwrap (128 bit key data)
 *  0b00010001..Key Wrap/Unwrap (256 bit key data)
 */
#define SGI_SGI_AUTO_MODE_CMD(x)                 (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_MODE_CMD_SHIFT)) & SGI_SGI_AUTO_MODE_CMD_MASK)
/*! @} */

/*! @name SGI_AUTO_DMA_CTRL - SGI Auto Mode Control register */
/*! @{ */

#define SGI_SGI_AUTO_DMA_CTRL_IFE_MASK           (0x1U)
#define SGI_SGI_AUTO_DMA_CTRL_IFE_SHIFT          (0U)
/*! IFE - Input FIFO DMA Enable
 *  0b0..DMA handshake disabled
 *  0b1..DMA handshake enabled
 */
#define SGI_SGI_AUTO_DMA_CTRL_IFE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_IFE_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_IFE_MASK)

